{"podcast_details": {"podcast_title": "Entrepreneurs on Fire", "episode_title": "How to Make Your Pain Insanely Profitable with Brodie Kern: From the 2020 archive", "episode_image": "https://ssl-static.libsyn.com/p/assets/6/0/1/2/60126ff156e9c59de5bbc093207a2619/EOF22.png", "episode_transcript": " Boom! Shake the room Fire Nation! JLD here and welcome to Entrepreneurs on Fire brought to you by the HubSpot podcast network, the audio destination for business professionals with great shows like Side Hustle Pro. Today we're pulling a timeless EO Fire episode from the archives so the giveaway may not be active and we'll be breaking down how to make your pain insanely profitable and to drop these value, we have brought Brody Kern into EO Fire Studios. Very few coaches have walked the walk like Brody Kern. After overcoming a drug addiction, Brody evolved into a set of executed actions that are designed to build a system that attracts clients, close clients, fulfills deals and retains clients. And we'll talk about business tactics and ability and how you are not your story, you are not your past and so much more. And a big thank you for sponsoring today's episode goes to Brody and our sponsors. The Gold Digger podcast hosted by Jenna Kuchar is brought to you by the HubSpot Podcast Network, the audio destination for business professionals. The Gold Digger podcast helps you discover your dream career with productivity tips, social strategies, business hacks, inspirational stories, and so much more. One of my favorite recent episodes is titled, How I've built an unmatched team culture, an insanely important topic for all business owners to dive into. Listen to Gold Digger wherever you get your podcasts. Brody, say what's up to Fire Nation and share something interesting about yourself that most people don't know. Fire Nation, what is going on? I am very excited to be here. So something interesting about myself that most individuals do not know is something that I talk about or that I don't talk about very often is Dude, I've totally struggled with weight in the past and like I take fitness very very seriously at these points now But it's still like it's still this thing that I am battling, trying to like keep my weight where I want it to be. And so, you know, it's like, it's that one little thing still in me that like, I have reserves about the way I look. And so like I want to lead with a point of vulnerability here, cause we're going to dig into a ton of stuff, um, about mindset, about the way that people view you and like, dude, it's important to highlight that like we all have our thing. We all have something that we, we still worry about. It's just constant work there. Every single person, like the most perfect person you think in the world, Fire Nation, for any number of reasons. Why? Because you might think they're perfect because they're rich or wealthy or financially successful or great looking or perfect abs. Believe me, they are vulnerable and they are self-conscious about something because everybody deals with that. It's just a human trait and it's just great to be open, honest and transparent about it because that's how we come together Fire Nation. And we're gonna be talking about how to make your pain insanely profitable and Brody, let's be honest. Most people have dealt with some form of trauma in their life. Most people have dealt with some form of addiction. You know, it could be something like addicted to coffee and caffeine, or it could be something like addicted to sleeping pills, or, you know, of course you can go all the way up the ladder, but the reality is trauma addiction, they are part of most people's past and a lot of people's present right now. So you're the perfect person to talk about this specific topic because you've dealt with 18 years worth of trauma and specifically four years worth of addiction. So talk to us about that journey that you've been on and what you've learned from that. Absolutely. And I mean, you are totally right in saying, like, everybody has their form of trauma. And so, like, we're gonna dig into a ton of my story, but the thing that I want the listeners to understand is like, trauma is always trauma, right? For me, my addiction and rough upbringing is also the same as some people being bullied when they were young or being overweight, or whatever it is. And so trauma, you know, trauma takes a hold in someone's mind and it really needs to be unpacked and learned from in order to grow. And that's where I think, you know, that's why I felt so compelled to share my story is because I grew up, you know, for 18 years as a scared kid, I had a mother who was an alcoholic very mentally physically abusive and I was constantly Experiencing trauma and leading into early adulthood, you know, I just I was still scared. I was still I was still hurt I was traumatized, you know, and and the only thing that I could figure out how to do was to Sedate and hide from the reality that I knew. And that led into tons of self-induced pain, tons of destruction, and ultimately forged me into, you know, who I am today, or at least put me on the path to becoming who I am today. Let's talk about specifically what you've learned. Like, give us some really big lessons that you feel like our audience foundation could resonate with, you know, when they've dealt with trauma, when they've dealt with addiction. What are those lessons? Some of the biggest lessons that I have taken away from it, and I didn't even really get a hold of these lessons and start to really understand them until I started to work with other men. But it's like, dude, we all struggle with the feeling of not being enough. Right. And so like that trauma, that was the thing that it left me with the most. I had pinned it in my head when I was young that if I was better, my mother wouldn't drink. And time and time again, that just, that just didn't happen. And so I built this identity around a story that just wasn't even true. And when I look at a lot of the trauma that I've experienced, or, you know, I break all of it down, it often ends up that way. I'm telling myself about a story, I'm telling myself a story about a situation that I had no control over. And I am bas my self-worth in that story. And people do this all the time. I have done it time and time again. And when I was basing self-worth in stories that were built out of trauma and that weren't true, it created a very, very low experience of life. Fire Nation, am I enough? Like have you ever asked yourself that question? Have you ever looked in the mirror and said something along the words of of am I enough? And you know the answer that I know myself and Brody want to get across to you today is like yes Absolutely, you are enough. But now how can we really not to just say those words? But believe those words but live those words and something that you're a big proponent of Brody that I love is the fact that we all have perceived self-limitations. Like we all put these limitations, we put these ceilings up of like, you know, oh, I can never make a million dollars. I can never get washboard abs. I can never get that guy or that girl. I can never get that job. I could never go on that vacation. I can never do this, that, or whatever it might be. Talk to us about the importance of first finding and then exceeding these perceived limitations that we put on ourselves. This has been something that I have really, really, really dove into over the last four or five years. Whenever I went through getting sober, every single day I was finding myself doing something that I never imagined possible and that was just staying sober. And you know, the way that I did it is by really pushing things in the moment. And so like I was never, I was never thinking about how am I gonna stay sober for 10, 15 years? Um, but always just focusing on the right now. And that's when I really started to develop some present moment awareness. And every single day, like that was a huge win. That was a huge win. I mean, when 30 days came, when 60 days came, when 90 days came, they were huge wins. Oddly enough today, I realized John is actually, um, is actually my sobriety date. And, uh, so I have four years, four years sober today. Um, almost forgot about the thing, but the reason that I tell you that is because when you were pushing yourself to your perceived limit and trying to exceed past that so that you can create a new reality, you can have something that you want that you don't currently have, right? You mentioned a ton make seven figures, run a marathon, like go on vacation, like do all of these things that we never knew we could do. And the reason that we never knew we could do them is because we haven't experienced them up until this point. And you see the brain, it only it's only way to predict what can happen in the future from a stance of belief is by basing it on the past. And in order to change something in order to acquire something new, you have to really take yourself to a new place totally outside of your comfort zone totally outside of your identity. And the only way that you can do that is by staying incredibly present in the moment because that is the only thing that you're ever going to be able to control. There is like, I wish you luck trying to beat the present moment or trying to leave the present moment. But understand that like, if you want something new in your life, it's going to take new actions in the moment, your entire life that results in your life, they are a collection of what you have been doing moment by moment up until this point. And so if you want to go somewhere new, you have to right now in this moment, push yourself to that limit and pass it and pass it. And as you approach that limit, your ego is going to say, Hey, you need to stop. Hey, we we've never been here before. Hey, we don't know if we can survive this. And you have to be able to separate yourself from the ego so that you can push forward into something new. So many value bombs here. I want to kind of double back on two things that really specifically struck a chord for me. Number one was in order to change something Fire Nation, you need to get out of your comfort zone. You've heard me say this before, that all the magic happens outside of your comfort zone. Well, this is exactly what Brody's talking about. If you want to change something in your life, you can't just be doing the same things of Netflix and chilling. That's not going to get you to where you want to be. You're going to get out of your comfort zone. Do things that are not comfortable, that are not normal, that make you potentially a little nervous, a little fearful, a little, you know, having some anxiety. Like that's not always bad in your life. And I want to really hammer down the second point as well. Be present. Like don't be this time traveler. Like I feel like James Altucher puts it really well. He's like, why are you trying to be a time traveler? Like why are you always thinking about things in the past or worried about things in the future? Like you're depressed about things and decisions you made 10 years ago, and you're scared about things that might or might not happen in five years, like why? Why are you being a time traveler? Be present in this moment. And Brody has mucho, mucho value bombs coming up as soon as we get back from thanking our sponsors. If you're anything like me, then you're looking forward to a lot of outdoor time this summer. I'm talking about hitting the pool, going on epic hikes, and maybe even getting in a few pickleball matches. But in order to do all that, you and your team need to work smarter, not harder. That's why we're so excited about HubSpot's integrated AI tech. It's helping teams automate the more tedious parts of running a business. With AI-powered tools built into HubSpot CRM, you can do research, pull reports, and write, copy, and a flash. In fact, recent research shows that marketers are already slicing time spent on manual administrative tasks in half thanks to AI. From 5 hours to 2.5 hours a day, which amounts to almost 4 weeks of saved time per year. And with four weeks of your time back, you could be enjoying a lot more pool time, hiking and pickleball. So what are you waiting for? Learn more and get started today at HubSpot.com. So Brittany, we're back and I actually did an entire journal three years ago, which I called the Mastery Journal, all about mastering, productivity, discipline, and focus. Fire Nation loved it. You know, we did over $280,000 in journal sales in just 33 days because my audience realizes the importance of self mastery. And you believe this is the most important skill that one person can obtain. So you've got me on board. I know you've got a lot of people that are like holding their mastery journals in hands right now. They're on board. But talk to us about this belief about self mastery. Dude, I love, I love that you did that because they're, you know, unfortunately, I feel like are not as many people talking about the conversation of self mastery or personal power as there needs to be. You know, if you were listening to this podcast, you were likely an ambitious individual who wants more out of their life. And we as humans have a habit and a tendency of getting ahead of ourselves. And so what I mean by that is I coach a lot of young male entrepreneurs, and they all come in because they want to experience business growth and financial success. But what I have to what I have to tell them before we give them, you know, the granular business tactics is we have to get into the game of personal power and self mastery. It is the prerequisite to success. And if you possess that if you possess true control over your emotions over your ability to act and execute inside of the moment Then you can do anything business fitness, it's all Totally mechanical which we are going to talk about a little bit later But where it becomes complicated is when you when you mix it with the human condition if you can control the emotion in the moment? And control your ability to execute, regardless of how much chaos is going on around you, you can quite literally do anything that you want. And this isn't some self-help like, you know, motivational stuff. Like this, this is the truth. The most disciplined, the most powerful people in the world, they are that way because they can control themselves in the moment, regardless of what stimulus is coming in. Let me tell you just a fact by your nation. You find somebody unsuccessful and you just ask them this question. What did you do yesterday? And guess what? They'll ramble off a couple random things, but they'll give you very little as far as any kind of routine, any kind of structure, any type of, you know, actual schedule that they adhere to. It's completely random. They're just living their life randomly. You talk to any successful person that you need to say, what did you do yesterday? And they're going to do one or two things. They're going to rattle off. Like I woke up at 5.35 AM and I went and drank my glass of water. Then I went and I worked out for 25 minutes. I jumped in the infrared sauna and then I did some 15 minutes of yoga. Then I took my dog for a walk and they're going to be able to go through it. Or they're going to pull up their phone and say, let me look at my calendar because it's right there. And my calendar is so structured and they're going to rip down all the things they did. I'm actually in the latter camp because I love living by my calendar. It is so structured. It keeps me so disciplined because I believe the word discipline means you are a disciple to a plan of action and then you execute that. It comes from my military days for sure, but that is part of my personal self mastery. Successful people, they can tell you exactly what they did yesterday. What moved the ball forward, what they're going to improve upon, etc., etc. Unsuccessful people. Yeah, I went to the store and I bought some eggs and then I watched this new show on Netflix. I forget what it's called. And yeah, I watched my dog at least one. Yeah, that's the difference. So I want to move into this next topic, which you kind of alluded to already, Brody, which is business is mechanical. Expound upon that. Absolutely. And so, I mean, you made an incredible point, right? Like when you ask a successful person what they do, they are going to be able to tell you they are intentional with everything they are doing and how they are spending their time. And, you know, why I'd like to talk about business being mechanical is because business is simply, you know, a set of executed actions that are designed to build a system that attracts clients, closes clients, fulfills on deals, and retains clients. Business is a collection of systems, and systems are built by individuals who take action. If you lay the plan out, it is very simple. When we look at someone, whether they, let's take a young entrepreneur, right? Let's say they're an agency owner, a SaaS owner, they have some sort of company that they're building. And most often times, if you say, hey, what are you going to need to accomplish to double your business in the next couple of years or in the next year, whatever amount of time, they're going to be able to tell you, they know the plan, they know what needs to grow inside of their business, they know who they need to hire, they know, they know, you know, what new initiatives need to be rolled out. And then when you say, Well, how long have you known this, and they're gonna say, you know, quite a while, probably, I've known this for a while. And then the question that you have to ask them is, why have you not executed on this? And it goes back to our point before of, you know, they do not have a high level of personal power or self mastery, they do not have a high level of personal power or self mastery. They can't commit to a schedule. They can't control the moment. And so many of us are not lacking, lacking business tactics or ability. We're simply lacking control over the moment and personal power. Like business is relatively easy. Being a human being is what makes it hard. Fire Nation, there are successful people and they have very successful traits. They are intentional about what they do. I don't want to beat a dead horse, but I want you to take that away. Are you being intentional with your days? Because that's what successful people do. They are intentional. And Brody, I really want to end with a bang here because the reality is this. There are real entrepreneurs and there are fake entrepreneurs. Distinguish the two for us. What does it mean to be a real entrepreneur? because it is my mission to really help young men who are in business to really level up every single area of their lives and become a real entrepreneur. But like many, I have grown my brand and my business off of social media and the space itself is very polluted by fake entrepreneurs. And these are individuals who know, in my opinion, no real business. They are self-employed at best. They exchange time for money and what they do is, you know, they will prospect, they will close and they will fulfill on all of the deals themselves. And I want to, I want to also say that like there's a period of time inside of business where this is required, but the individuals who are not real entrepreneurs, in my opinion, they do this for extended periods of time, potentially forever. In order to become a real business owner, you must start thinking about systems, you must start thinking about building a team and hiring who you need to so that you can fire yourself and leverage yourself out of positions inside of the company. If you were wearing all the hats inside of your business, you may be stepping into being an entrepreneur. But if you think that that is going to be the rest of your life and that makes you a business owner, you the way, firing yourself. So Brody, you've dropped value bomb after value bomb today. What's the one thing that you really want to make sure Fire Nation gets? Like kind of go back over everything we've talked about. What's the one legitimate takeaway that you think Fire Nation needs to know out of all the awesomeness that we talked about here today, then share how we can find out more about you, any call to action or gifts you have for Fire Nation, then we'll say goodbye. Absolutely, so the number one thing that I would like the listeners to take away is that you are not your stories, you are not your past, you are not even what your external reality looks like right now. The thing that I want you to understand is that you are, a being who has infinite potential. And if you want your future to change, it is going to be controlled by what you do next, what you do in this moment. If you do stuff in the moment, every single time that you can have that conscious moment of awareness and say, hey, I'm going to do something that moves the needle forward right now and I'm not going to go to themasterymethod.com, you can find out a ton of information about what we do. That is the best place to look at all of our content. We put out a ton of podcasts, a ton of videos, and really, really, really try to help everyone that we can at whatever stage they are in their life. And I like everybody to know, too, I am open to connecting. I am a guy who I like to stay, I like to stay in touch with. I like to connect with people. I like to connect with people. I like to connect with people. I like to connect with people. I like to connect with people. I like to connect with people. I like to connect with people. I like to connect with people. I like to connect with people. I like to connect with people. I like to connect with people. I like to connect with people. I like to connect with people. I like to connect with people. I like to connect with people. I like to connect with people. I like to connect with people. I like to connect with people. I like to connect with people. I like to connect with people. I like to connect with people. I like to connect with people. I like to connect with people. I like to connect with people. I like to connect with people. I like to connect with people. I like to connect with people. I like to connect with people. I like to connect with people. I like to connect with people. I like to connect with people. I like to connect with people. I like to connect with people. I like to connect with people. I like to connect with people. I like to connect with people. I like to connect with people. I like to connect with people. I like to connect with people. I like to connect with people. I like to connect with people. I like to connect with people. I like to connect with people. I like to connect with people. I like to connect with people. I like everybody to know too, I am open to connecting. I am a guy who I like to stay involved with the people that follow me, with my community, and deliver as much value as I possibly can. And so whatever you're going through, whatever struggle you have, reach out to me. You can reach out to me there. You can reach out to me on Instagram. And we will make ourselves available here at WakeUpWealthy. A fellow podcaster, I love it. And if you're jiving with Brody's energy fire nation, which I know you are, make sure you do check him out. And one more time, what was that URL Brody? Themasterymethod.com. Fire Nation, you're the average of the five people you spend the most time with. And hello, you've been hanging out with BK and JLD today, so keep up that heat and head over to EOFire.com type Brody B-R-O-D-I-E in the search bar. His show notes page will pop up with everything that we've been talking about today. Best show notes in the biz. And Brody thank you brother for sharing your truth, your knowledge, your value with Fire Nation today. For that we salute you and we will catch you on the flipside. Thank you. Thanks for having me. Hey Fire Nation, today's value bomb contest. We're going to be talking about the best show notes in the biz. So if you're interested in finding out more about the best show notes in the biz, you can check out the link in the description below. And if you're interested in finding out more about the best show notes in the biz, you can check out the link in the description below. And if you're interested in finding out more about the best show notes in the biz, you can check out the link in the description below. And if you're interested in finding out more about the best show notes in the biz, you can check out the link in the description below. And if you're interested in finding out more about the best show notes in the biz, you can check out the link in the description below. And if you're interested in finding out more about the best show notes in the biz, you can check out the link in the biz, you can check out the link in the biz, you can check out the link in the biz, you can check out the link in the biz, you can check out the link in the biz, you can check out the link in the biz, you can check out the link in the biz, you can check out the link in the biz, you can check out the link in the biz, you can check out the link in the biz, you can check out the link in the biz, you can check out the link in the biz, you can check Fire Nation today. For that, we salute you and we will catch you on the flip side. Thank you. Thanks for having me. Hey, Fire Nation, today's value bomb content was brought to you by Brody. And if there's one thing that I've identified over the years is that successful entrepreneurs are productive, they're disciplined, they're focused. We talked about this a lot on the interview today, and that's why I created the Mastery Journal. It is a gorgeous faux leather journal that ensures that you master productivity, discipline and focus in 100 days. Fire Nation is my best work ever. Visit the Mastery Journal dot com. Use promo code podcast for fifteen dollar discount and thank you for listening to my podcast and I'll catch you there or I will catch you on the flip side. The Gold Digger podcast hosted by Jenna Kutuchar is brought to you by the HubSpot podcast network, the audio destination for business professionals. The Gold Digger podcast helps you discover your dream career with productivity tips, social strategies, business hacks, inspirational stories, and so much more. One of my favorite recent episodes is titled How I've Built an Unmatched Team Culture, an insanely important topic for all business owners to dive into. Listen to Gold Digger wherever you get your podcasts."}, "podcast_summary": "In this episode of Entrepreneurs on Fire, host JLD interviews Brody Kern, a coach and entrepreneur who has overcome addiction and trauma. Brody shares his journey and the valuable lessons he has learned along the way. One key takeaway is that you are not defined by your past or your stories. Brody emphasizes the importance of personal power and self-mastery in achieving success. He also highlights the distinction between real entrepreneurs and fake entrepreneurs, emphasizing the need to build systems and leverage oneself out of the business. If you want to learn more about Brody and his work, you can visit themasterymethod.com.", "podcast_guest": {"name": "Brody Kern", "org": "EO Fire Studios", "title": ""}, "podcast_highlights": "Attention Fire Nation! Get ready for an electrifying episode of Entrepreneurs on Fire, sponsored by the HubSpot podcast network. In this episode, we have the incredible Brody Kern, a coach who has walked the walk and transformed his life after overcoming a drug addiction. Brody will share his insights on how to make your pain profitable and the power of leaving behind your past.\n\nBut before we dive in, let's take a minute to thank our sponsors. We have the Gold Digger podcast, hosted by Jenna Kutcher, a hidden gem on the HubSpot podcast network. The Gold Digger podcast is your go-to resource for productivity tips, social strategies, business hacks, and inspirational stories. If you're looking to build your dream career, you won't want to miss Jenna's episode on building an unmatched team culture. Find the Gold Digger podcast wherever you get your podcasts.\n\nNow, let's get back to the episode. Brody opens up about his personal struggle with weight and the constant battle to maintain it. By sharing this vulnerability, he highlights the importance of embracing our insecurities and understanding that we all have our own struggles.\n\nThe conversation then delves into the topics of trauma and addiction. Brody emphasizes that everyone has some form of trauma and that it's crucial to unpack and learn from it in order to grow. He shares valuable lessons, such as the feeling of not being enough, and how we tend to base our self-worth on untrue stories that we tell ourselves. Understanding this can lead to a higher experience of life.\n\nBrody then shifts the focus to self-mastery, reiterating that it is the most important skill an entrepreneur can possess. He emphasizes the need to control our emotions, take intentional action, and be present in the moment. By doing so, we can navigate through challenges and achieve success.\n\nFinally, Brody distinguishes between real entrepreneurs and fake entrepreneurs. Real entrepreneurs understand the importance of building systems and delegating tasks, while fake entrepreneurs remain self-employed and exchange time for money. Developing systems and hiring a team allows entrepreneurs to step away from day-to-day operations and focus on scaling their business.\n\nIn conclusion, the key takeaway from this episode is that you are not defined by your past or your stories. You have unlimited potential, and changing your future starts with taking action in the present moment. If you want to learn more from Brody Kern, visit themasterymethod.com or reach out to him on Instagram.\n\nFire Nation, don't miss out on this transformative episode! Embrace your vulnerabilities, learn from your past, and unleash your entrepreneurial potential."}